## REORDENAR COLUNAS

In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({'NOME':['MARIA','Sandra'],
              'ALTURA':[1.77,1.65],
              'PESO':[65, 72],
              'IDADE':[40, 20]})
df

     NOME  ALTURA  PESO  IDADE
0   MARIA    1.77    65     40
1  Sandra    1.65    72     20

REORDENAR COLUNAS UTILIZANDO ATRIBUIÇÃO DIRETA

In [3]:
df.columns

Index(['NOME', 'ALTURA', 'PESO', 'IDADE'], dtype='object')

In [4]:
df['NOME']

0     MARIA
1    Sandra
Name: NOME, dtype: object

In [5]:
df[['ALTURA', 'NOME', 'PESO', 'IDADE']]

   ALTURA    NOME  PESO  IDADE
0    1.77   MARIA    65     40
1    1.65  Sandra    72     20

In [6]:
# atribuição direta
df = df[[ 'ALTURA', 'PESO', 'IDADE','NOME']]
df

   ALTURA  PESO  IDADE    NOME
0    1.77    65     40   MARIA
1    1.65    72     20  Sandra

REORDENAR COLUNAS UTILIZANDO O MÉTODO .reindex()

https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.reindex.html

In [7]:
df = pd.DataFrame({'NOME':['MARIA','Sandra'],
              'ALTURA':[1.77,1.65],
              'PESO':[65, 72],
              'IDADE':[40, 20]})
df

     NOME  ALTURA  PESO  IDADE
0   MARIA    1.77    65     40
1  Sandra    1.65    72     20

In [8]:
df.reindex(columns=[ 'IDADE','ALTURA', 'PESO', 'NOME'])

   IDADE  ALTURA  PESO    NOME
0     40    1.77    65   MARIA
1     20    1.65    72  Sandra

In [9]:
df = df.reindex(columns=[ 'IDADE','ALTURA', 'PESO', 'NOME'])
df

   IDADE  ALTURA  PESO    NOME
0     40    1.77    65   MARIA
1     20    1.65    72  Sandra

In [10]:
df = pd.DataFrame({'NOME':['MARIA','Sandra'],
              'ALTURA':[1.77,1.65],
              'PESO':[65, 72],
              'IDADE':[40, 20]})
df

     NOME  ALTURA  PESO  IDADE
0   MARIA    1.77    65     40
1  Sandra    1.65    72     20

In [13]:
# inverter ordem das colunas

lista_colunas = list(df.columns)

lista_colunas.reverse()

lista_colunas

['IDADE', 'PESO', 'ALTURA', 'NOME']

In [12]:
type(list(df.columns))

list

In [11]:
type(df.columns)

pandas.core.indexes.base.Index

In [15]:
df = df[lista_colunas]

In [16]:
df

   IDADE  PESO  ALTURA    NOME
0     40    65    1.77   MARIA
1     20    72    1.65  Sandra